app/controllers/pubs_controller.rb

  def index
    @pubs = Pub.all
---
SELECT "pubs".* FROM "pubs"

  def create
    @pub = Pub.new(pub_params)

    respond_to do |format|
      if @pub.save
---
INSERT INTO "pubs" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-08-17 09:48:30.587529"], ["description", "This is the red lion pub"], ["name", "The Red Lion"], ["updated_at", "2014-08-17 09:48:30.587529"]]

  def update
    respond_to do |format|
      if @pub.update(pub_params)
---
UPDATE "pubs" SET "address" = $1, "beer_selection" = $2, "directions" = $3, "easy_to_get_on_board" = $4, "number_of_dartboards" = $5, "quiz_machine" = $6, "rest_of_pub" = $7, "updated_at" = $8 WHERE "pubs"."id" = 2