app/controllers/regions_controller.rb

SELECT "regions".* FROM "regions"
---
  def index
    @regions = Region.all

SELECT "regions".* FROM "regions"
---
  def new
    @region = Region.new
    @regions = Region.all

SELECT "regions".* FROM "regions"
---
  def edit
    @regions = Region.all

INSERT INTO "regions" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-08-17 09:33:42.922495"], ["name", "South East"], ["updated_at", "2014-08-17 09:33:42.922495"]]
---
  def create
    @region = Region.new(region_params)

    respond_to do |format|
      if @region.save