app/views/pubs/_form.html.erb

SELECT "regions".* FROM "regions"
---
        <%= f.label :region %><br>
        <%= f.select :region_id, options_from_collection_for_select(@regions, :id, :name, @pub.region_id), {}, class: 'form-control' %>

SELECT "pubs".* FROM "pubs"
---
        <%= f.label :easy_to_get_on_the_board %><br>
        <%= f.select :easy_to_get_on_board, Pub::EASY_TO_GET_ON_BOARD_OPTIONS, {}, class: 'form-control' %>